{
  "lorem": {
    "text": "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، وإذا قمت بإدخال في أي محرك بحث ستظهر العديد من المواقع الحديثة العهد في نتائج البحث. على مدى السنين ظهرت نسخ جديدة ومختلفة من نص لوريم إيبسوم، أحياناً عن طريق الصدفة، وأحياناً عن عمد كإدخال بعض العبارات الفكاهية إليها"
  },
  "sidebar": {
    "home": "الرئيسية",
    "about": "عني",
    "skills": "المهارات",
    "projects": "المشاريع",
    "contact": "تواصل",
    "general": "عام"
  },
  "home": {
    "WaseeM": "وسيم",
    "myNameIs": "مرحبا، اسمي",
    "crafting": "ابتكار",
    "interactive": "تجارب ويب",
    "webExperiences": "تفاعلية",
    "homeDesc": "مهندس برمجيات متكامل (Full-Stack) ابني تطبيقات ويب وموبايل\n قابلة للتوسّع وعالية الأداء، بهندسة نظيفة وحركة محسّنة ومتقنة.",
    "contactMe": "تواصل معي",
    "myWork": "اعمالي"
  },
  "about": {
    "fullName": "وسيم العمد",
    "point1": "مطور برمجيات متكامل مقيم في الأردن، أتقن اللغتين العربية والإنجليزية. أقوم ببناء تطبيقات ويب وتطبيقات جوال قابلة للتوسع مع التركيز بشكل كبير على الأداء، الهيكلية، والهندسة النظيفة.",
    "point2": "قمت ببناء أنظمة معقّدة من الصفر — بما في ذلك تخطيطات Masonry مخصّصة، وتفاعلات السحب والإفلات (Drag-and-Drop)، ومنطق ترتيب محسّن، واستراتيجيات عرض افتراضي (Virtualization) مخصّصة للتعامل بكفاءة مع مجموعات بيانات كبيرة.",
    "point3": "أهتم بكيفية تصرّف التطبيقات في الاستخدام الفعلي — كيف تتدفق البيانات، وكيف تتوسّع المكوّنات، وكيف تبدو التجربة للمستخدم. هدفي هو بناء منتجات سريعة، مستقرة، وقابلة للاستمرار على المدى الطويل.",
    "point4": "في الواجهة الخلفية (Backend)، أقوم بتصميم واجهات برمجية منظّمة (APIs)، وإدارة قواعد البيانات، وتنفيذ تدفّقات بيانات آمنة مع تركيز على القابلية للتوسّع والوضوح. أعمل باستخدام Node.js وMongoDB وSupabase لبناء أنظمة موثوقة تدير المصادقة (Authentication)، والتخزين، والتحديثات الفورية بكفاءة."
  }
}
